flatiron_travellers/app/controllers/api/v1/travellers_controller.rb

      def index
        render json: Traveller.all
---
SELECT  "travellers".* FROM "travellers" ORDER BY "travellers"."id" ASC LIMIT ?  [["LIMIT", 1]]

      def show
        render json: Traveller.find(params[:id])
---
SELECT  "travellers".* FROM "travellers" WHERE "travellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]